<%@ page contentType="text/html;charset=utf-8" import="java.sql.*" %>
    <%request.setCharacterEncoding("utf-8");%>
<!DOCTYPE html>
<html>
    <head>
        <meta charset="UTF-8">
        <h2>Recipe!!</h2>
    </head>
    <body>
    떡볶이
<p>
간장떡볶이
재료: 떡국떡300g , 쇠고기 100g , 다진마늘, 참기름 1작은술씩 , 양파 1/3 , 스위트콘30g , 소금 후추 약간 <p>
양념장 : 간장5큰술 , 설탕 2큰술, 다진파, 참기름 1큰술씩, 다진마늘 1 작은술, 깨, 소금, 후추 조금 ,물 1/2컵 <p>
<p><hr>
만드는법 <p>
1. 쇠고기는 먹기 좋게 자르고 마늘, 참기름 , 소금, 후춧가루로 밑간한다<p>
2. 떡국떡은 흐르는 물에 씻어 건지고, 양파는 채썬다. 통조림 스위트콘은 물에 살살 씻은 후 채반에 밭쳐 물기를 뺀다.<p>
3. 팬에 쇠고기를 넣어 볶다가 고기가 익으면 떡국떡을 넣고 양념장을 넣어 볶는다. <p>
4. 떡에 양념이 배면 양파, 스위트콘을 넣어 살짝 볶아 완성한다. <p>
</body>
</html>